# GetConstruction Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSurface..::..GetConstruction Method
EnergyAnalysisSurface Class See Also
---
Gets the analytic construction this surface is associated with.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public EnergyAnalysisConstruction GetConstruction()
```

Visual Basic
---
```text
Public Function GetConstruction As EnergyAnalysisConstruction
```

Visual C++
---
```text
public:
EnergyAnalysisConstruction^ GetConstruction()
```

# ### Return Value
The analytic construction.
# See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace